{
  "effects": [
    { "id": 1, "text": "Roll an extra d20 and add it to the next attack roll." },
    { "id": 2, "text": "You cast a random cantrip (GM chooses the spell) centered on yourself." },
    { "id": 3, "text": "Your hair stands on end; you take a -1 penalty to Stealth checks for 1 hour." },
    { "id": 4, "text": "A shower of harmless sparks falls from you for the next minute." },
    { "id": 5, "text": "You gain resistance to fire for 1 minute." },
    { "id": 6, "text": "You smell like rosemary for 24 hours. Advantage on any cooking checks." },
    { "id": 7, "text": "A spectral shield appears and grants +1 AC for the next minute." },
    { "id": 8, "text": "You teleport 5 feet in a random direction (must be unoccupied)." },
    { "id": 9, "text": "Your next spell is cast at one higher spell slot (no extra components)." },
    { "id": 10, "text": "You are frightened of the nearest creature for 1d4 rounds." },
    { "id": 11, "text": "You glow with faerie light; shedding dim light in a 10-foot radius for 1 hour." },
    { "id": 12, "text": "Your weapon turns into a harmless rubber chicken for 1 minute." },
    { "id": 13, "text": "You gain 1d6 temporary hit points." },
    { "id": 14, "text": "Your voice becomes comically high-pitched for 10 minutes." },
    { "id": 15, "text": "You are covered in harmless flowers that last 24 hours." },
    { "id": 16, "text": "All coins in your pockets are transformed into chocolate for 1 hour." },
    { "id": 17, "text": "You can speak with animals for 10 minutes." },
    { "id": 18, "text": "Your skin turns bright blue for 1d6 hours." },
    { "id": 19, "text": "You emit a soft hum that grants allies within 10 feet +1 on saving throws for 1 minute." },
    { "id": 20, "text": "You grow a small, useless tail for 24 hours." },
    { "id": 21, "text": "A burst of confetti explodes from you; creatures within 5 feet are distracted (disadvantage on next attack)." },
    { "id": 22, "text": "Your eyes glow; you can see invisible creatures for 1 minute." },
    { "id": 23, "text": "You become ethereal for one round (no interaction with physical objects)." },
    { "id": 24, "text": "Your hands turn into salamanders for 1 minute (cannot hold objects)." },
    { "id": 25, "text": "A tiny dragon (harmless) perches on your shoulder for 1 hour and sings." },
    { "id": 26, "text": "You are compelled to dance for 1d4 rounds." },
    { "id": 27, "text": "A random nearby object becomes sticky (like tar) for 10 minutes." },
    { "id": 28, "text": "You cast Mage Hand, but it insists on writing compliments about you." },
    { "id": 29, "text": "Your next spell has its verbal component replaced by a dramatic monologue." },
    { "id": 30, "text": "You sprout harmless butterfly wings and can glide for 1 minute." },
    { "id": 31, "text": "A soft breeze follows you, carrying the scent of the sea for 1 hour." },
    { "id": 32, "text": "All food within 10 feet tastes like strawberries for 24 hours." },
    { "id": 33, "text": "You gain advantage on the next Persuasion check, but disadvantage on the next Stealth check." },
    { "id": 34, "text": "You briefly speak in rhymes for the next 10 minutes." },
    { "id": 35, "text": "A small cloud rains politely on you for 1 minute (no damage)." },
    { "id": 36, "text": "Your hands can pass through solid wood for 1 minute." },
    { "id": 37, "text": "You randomly teleport to a nearby spot you can see (GM decides) and giggle." },
    { "id": 38, "text": "Your height is reduced by 6 inches for 24 hours." },
    { "id": 39, "text": "All written text in 10 feet becomes slightly more legible for 1 hour." },
    { "id": 40, "text": "You gain a temporary familiar in the form of a glowing moth for 24 hours." },
    { "id": 41, "text": "Your shadow detaches and performs a short, silent play." },
    { "id": 42, "text": "You smell like ozone; electronic devices within 5 feet behave oddly for 1 minute." },
    { "id": 43, "text": "You are surrounded by illusory butterflies that gently distract foes (disadvantage on one attack roll)." },
    { "id": 44, "text": "A harmless clone of you appears and mirrors your gestures for 1 minute." },
    { "id": 45, "text": "You learn one random cantrip for 24 hours." },
    { "id": 46, "text": "Your voice echoes two seconds later for 10 minutes." },
    { "id": 47, "text": "A random small trinket appears in your hand." },
    { "id": 48, "text": "You gain the ability to breathe underwater for 1 hour." },
    { "id": 49, "text": "Your next failed saving throw becomes a critical success instead (GM adjudicates)." },
    { "id": 50, "text": "The sky briefly shows constellations that tell a short story about you." }
  ]
}
