{
  "effects": [
    { "id": 1, "rarity": "Common", "text": "A tiny burst of confetti pops from your sleeve. Harmless and festive." },
    { "id": 2, "rarity": "Common", "text": "You smell faintly of lemon for 10 minutes. Pleasant but inconsequential." },
    { "id": 3, "text": "A polite breeze straightens a nearby person's collar. Purely cosmetic." },
    { "id": 4, "text": "Your next spoken sentence echoes once, theatrically." },
    { "id": 5, "text": "A small, friendly moth flutters around your shoulder for 1 minute." },
    { "id": 6, "text": "Your handwriting briefly writes itself a tiny bit neater for 5 minutes." },
    { "id": 7, "text": "A harmless sparkle appears at the tip of your finger when you point for 1 minute." },
    { "id": 8, "text": "You briefly gain the urge to hum; a pleasant tune follows you for 10 minutes." },
    { "id": 9, "text": "The next coin you toss spins in the air for an extra second before landing; no mechanical effect." },
    { "id": 10, "text": "Your shoes squeak melodically for the next minute. Charming, not harmful." },
    { "id": 11, "text": "A tiny ribbon appears on the first object handed to you in the next minute." },
    { "id": 12, "text": "You exhale a faint shimmer of harmless mist that smells like cinnamon." },
    { "id": 13, "text": "Your next short story told aloud becomes slightly more dramatic; roleplay benefit only." },
    { "id": 14, "text": "A small, harmless glow highlights the nearest helpful tool for 10 seconds." },
    { "id": 15, "text": "A friendly whisper in an unknown language compliments your hat for 1 minute." },
    { "id": 16, "text": "Your next sketch gains an extra charming doodle along the margin." },
    { "id": 17, "text": "A single harmless bubble appears when you speak loudly; it pops without consequence." },
    { "id": 18, "text": "A miniature lantern light hovers near your pack for 1 minute; decorative." },
    { "id": 19, "text": "You briefly feel like dancing; your next noncombat movement is especially graceful (flavor)." },
    { "id": 20, "text": "A tiny wind flips a page of a nearby book to a serendipitous line (DM decides usefulness)." },
    { "id": 21, "text": "Your next handshake is unusually warm and friendly; roleplay only." },
    { "id": 22, "text": "A faint, pleasant scent of pine follows you for 10 minutes." },
    { "id": 23, "text": "A tiny harmless star appears over your shoulder for 30 seconds and twinkles." },
    { "id": 24, "text": "Your coin purse jingles a cheerful tune for 1 minute; decorative." },
    { "id": 25, "text": "You briefly emanate a comforting warmth; allies may find you more reassuring (roleplay)." },
    { "id": 26, "text": "A polite gust rearranges a loose page of papers into a tidy stack." },
    { "id": 27, "text": "A tiny phantom quill writes a friendly note that fades after 1 minute." },
    { "id": 28, "text": "The next small snack you eat tastes exceptionally pleasant; purely flavorful." },
    { "id": 29, "text": "Your next whispered secret carries a soft echo that makes it sound more mysterious." },
    { "id": 30, "text": "A harmless stripe of color appears along your sleeve for 1 hour; cosmetic." },
    { "id": 31, "text": "A friendly firefly circles your head once and disappears." },
    { "id": 32, "text": "A tiny banner unfurls above you that reads \"+1 to Charm\" (obviously decorative)." },
    { "id": 33, "text": "A small patch of grass grows in a fanciful shape where you step for 10 seconds." },
    { "id": 34, "text": "You briefly smell like fresh bread; makes you slightly more appealing at bakeries (flavor)." },
    { "id": 35, "text": "Your next minor repair feels a touch easier; you gain +1 on a single tool check if DM allows (flavor)." },
    { "id": 36, "text": "A tiny, harmless shadow-play puppet performs on a nearby wall for 20 seconds." },
    { "id": 37, "text": "Your next written note decorates itself with tiny glowing margins for 1 minute." },
    { "id": 38, "text": "A faint chime sounds when you open a door in the next minute; decorative only." },
    { "id": 39, "text": "A small, friendly breeze tidies one tabletop within 5 feet; purely cosmetic." },
    { "id": 40, "text": "Your laughter for the next minute produces harmless glitter that drifts away." },
    { "id": 41, "text": "A single harmless spark forms into a smile above a nearby puddle and fades." },
    { "id": 42, "text": "A tiny, polite trumpet fanfare sounds when you stand up in the next minute; theatrical, not loud." },
    { "id": 43, "text": "A harmless soap bubble appears in your hand and floats away, bursting softly." },
    { "id": 44, "text": "Your next small sewing or mending task gains a subtle flourish; cosmetic." },
    { "id": 45, "text": "A cozy warmth spreads through your pockets for 1 minute; purely flavorful." },
    { "id": 46, "text": "A tiny helper bird straightens a nearby hat for you; decorative." },
    { "id": 47, "text": "Your next short song sounds just a bit fuller; roleplay advantage to Performance if DM allows." },
    { "id": 48, "text": "A harmless scent of lavender follows your next conversation for 5 minutes." },
    { "id": 49, "text": "A little note appears on your forearm that reads \"You are appreciated\" for 10 minutes." },
    { "id": 50, "text": "A tiny, harmless glow outlines the nearest useful tool for 10 seconds." },
    { "id": 51, "text": "A faint, friendly echo repeats the last thing you said once." },
    { "id": 52, "text": "A small, harmless puff of snow falls in a 3-foot radius around you and melts immediately." },
    { "id": 53, "text": "A single harmless sparkle appears at the edge of your vision for 1 minute." },
    { "id": 54, "text": "Your next small joke lands particularly well; roleplay only." },
    { "id": 55, "text": "A tiny, decorative ribbon ties itself on the nearest chair for 1 minute." },
    { "id": 56, "text": "A tiny, phantom cat naps on your pack for 1 minute; purely cosmetic." },
    { "id": 57, "text": "You exhale tiny harmless bubbles that pop with a soft musical note." },
    { "id": 58, "text": "A small, polite wind rearranges a scattered stack of papers into a neat pile." },
    { "id": 59, "text": "Your next small act of kindness feels especially heartfelt; roleplay boost only." },
    { "id": 60, "text": "A faint trail of harmless stars follows your next step for 5 seconds." },
    { "id": 61, "text": "A tiny lantern light floats beside you for 1 minute; decorative." },
    { "id": 62, "text": "Your next handwriting sample is particularly legible; flavor only." },
    { "id": 63, "text": "A small, harmless tune plays when you open a book for 30 seconds." },
    { "id": 64, "text": "You briefly smell like freshly cut grass; pleasant and inconsequential." },
    { "id": 65, "text": "A tiny phantom loaf appears and crumbles into harmless crumbs after 10 seconds; decorative." },
    { "id": 66, "text": "Your next small coin flip lands showing a tiny smiling face; decorative only." },
    { "id": 67, "text": "A harmless sparkle outlines the nearest useful map for 10 seconds." },
    { "id": 68, "text": "A single tiny feather floats down and lands on your shoulder then vanishes." },
    { "id": 69, "text": "A faint, pleasing scent of apples follows you for 10 minutes." },
    { "id": 70, "text": "A miniature rainbow arcs over your head for 15 seconds; purely cosmetic." },
    { "id": 71, "text": "A tiny, friendly sprite straightens a nearby picture on a wall for 10 seconds." },
    { "id": 72, "text": "Your next short conversation feels more memorable; roleplay only." },
    { "id": 73, "text": "A gentle chime sounds when you place an object down in the next minute; decorative." },
    { "id": 74, "text": "A tiny, harmless paw print appears where you step for 10 seconds; decorative." },
    { "id": 75, "text": "Your next small baked item you make tastes exceptionally good; flavor only." },
    { "id": 76, "text": "A small, harmless shimmer outlines the nearest door handle for 10 seconds." },
    { "id": 77, "text": "A tiny paper crane folds itself and flutters away; purely decorative." },
    { "id": 78, "text": "A harmless bell rings softly when you laugh for the next minute." },
    { "id": 79, "text": "A small, polite ghost politely applauds when you finish speaking; decorative." },
    { "id": 80, "text": "Your next short song has a tiny echo that makes it sound fuller; roleplay only." },
    { "id": 81, "text": "The next creature to hand you an object will find it wrapped in a tiny ribbon (harmless cosmetic) for 1 minute." },
    { "id": 82, "text": "You speak in a slightly older dialect for 10 minutes; flavor only." },
    { "id": 83, "text": "A small pile of colorful leaves appears at your feet and rustles pleasantly for 1 minute." },
    { "id": 84, "text": "Your pouch jingles the tune of your homeland for 10 minutes; decorative." },
    { "id": 85, "text": "Tiny stars dance across your forearm for 1 minute; purely cosmetic." },
    { "id": 86, "text": "A small, harmless projection of your face does a silly expression for 10 seconds; purely cosmetic." },
    { "id": 87, "text": "Your next quickly-taken note is decorated with tiny glowing margins for 1 minute." },
    { "id": 88, "text": "A polite gust rearranges a nearby person's collar into a flattering angle; roleplay only." },
    { "id": 89, "text": "You exhale a puff of harmless lantern light that brightens a 5-foot area for 1 minute; extinguishes easily." },
    { "id": 90, "text": "Your next small sewing or mending task feels easier; decorative bonus if DM allows." },
    { "id": 91, "text": "A faint, friendly jingling follows your footsteps for 10 minutes; decorative." },
    { "id": 92, "text": "Your next whispered secret carries a little echo and sounds more dramatic; no mechanical effect." },
    { "id": 93, "text": "You briefly exhale tiny bubbles that smell like mint; they pop harmlessly." },
    { "id": 94, "text": "A small, harmless phantom squirrel appears and fetches a nearby shiny trinket (DM discretion) for 1 minute." },
    { "id": 95, "text": "A single harmless spark pops from your mouth when you speak loudly for 1 minute; no damage." },
    { "id": 96, "text": "Your next step on stone causes a tiny decorative crack of light to bloom and fade; decorative." },
    { "id": 97, "text": "A little note floats out of your sleeve and writes a compliment to you, then vanishes after 1 minute." },
    { "id": 98, "text": "For 1 minute, your laughter causes small harmless blossoms to appear where you step." },
    { "id": 99, "text": "You taste a memory of seaside picnics; purely flavorful and pleasant." },
    { "id": 100, "text": "A harmless glow highlights the nearest useful item for 10 seconds (DM determines usefulness)." },
    { "id": 101, "text": "Your next loaf of bread tastes especially good; flavor only." },
    { "id": 102, "text": "A tiny phantom cat naps on your pack for 1 minute; purely cosmetic." },
    { "id": 103, "text": "You can murmur to small birds for 10 minutes; they respond with chirps (flavor)." },
    { "id": 104, "text": "A friendly invisible hand straightens one small item within reach for 1 minute; decorative." },
    { "id": 105, "text": "You gain a faint scent of vanilla for 10 minutes; pleasant but inconsequential." },
    { "id": 106, "text": "A small, harmless sparkle appears each time you blink for 1 minute; cosmetic." },
    { "id": 107, "text": "A polite drumbeat follows you for 10 seconds when you make a dramatic exit; decorative." },
    { "id": 108, "text": "Your next simple tool use feels slightly easier; flavor only if DM permits." },
    { "id": 109, "text": "A tiny glimmering path lights up for 5 feet where you step for 10 seconds; decorative." },
    { "id": 110, "text": "You briefly smell like rain for 10 minutes; pleasant and flavorful." },
    { "id": 111, "text": "A tiny friendly echo repeats your last sentence once for 1 minute; purely cosmetic." },
    { "id": 112, "text": "You produce a single harmless soap bubble that floats nearby for 1 minute; decorative." },
    { "id": 113, "text": "Your next attempt to recall a face feels easier; roleplay boost only." },
    { "id": 114, "text": "A small, harmless gust flips a lock of hair into your eyes dramatically for 1 minute; cosmetic." },
    { "id": 115, "text": "Your next written note decorates itself with tiny, irrelevant doodles that are charming." },
    { "id": 116, "text": "You briefly emanate the scent of fresh cookies for 10 minutes; purely flavorful." },
    { "id": 117, "text": "A harmless sparkly trail fades behind your next thrown noncombat item for 1 minute; decorative." },
    { "id": 118, "text": "A small, polite trumpet fanfare sounds when you stand up for 10 seconds; decorative." },
    { "id": 119, "text": "You temporarily have faint glowing tattoos on your arms for 1 hour; purely cosmetic." },
    { "id": 120, "text": "A friendly, tiny wind tickles a nearby creature's nose causing them to sneeze once (harmless)." },
    { "id": 121, "text": "Your next minor repair is slightly easier; flavor bonus only if DM allows." },
    { "id": 122, "text": "A harmless golden coin appears in your hand and turns into dust after 1 minute; decorative." },
    { "id": 123, "text": "A soft, tiny harp chord sounds when you look at a painting for 1 minute; decorative." },
    { "id": 124, "text": "Your voice briefly takes on the timbre of a bard for 1 minute; roleplay only." },
    { "id": 125, "text": "A small, friendly ghost cat appears and follows you for 1 minute; harmless." },
    { "id": 126, "text": "For 1 minute your pockets feel slightly warmer; purely flavorful." },
    { "id": 127, "text": "You gain a tiny, translucent map that shows only your immediate surroundings for 1 minute; decorative." },
    { "id": 128, "text": "A faint aroma of spice wafts from your hands for 10 minutes; decorative." },
    { "id": 129, "text": "A harmless little spark pops as you swing a weapon once in the next minute; decorative." },
    { "id": 130, "text": "Your next short spoken story becomes more lively; roleplay only." },
    { "id": 131, "text": "A tiny pair of wings appear on your shoes for 1 minute and flap adorably; no flight benefit." },
    { "id": 132, "text": "A harmless glitter ring appears briefly at your feet when you cast a spell for 1 minute; decorative." },
    { "id": 133, "text": "A small pigeon delivers a flattering note to you within 1 minute (DM roleplay)." },
    { "id": 134, "text": "A miniature rainbow arches over your head for 1 minute; purely decorative." },
    { "id": 135, "text": "You temporarily speak with a slight accent of an obscure region for 1 hour; roleplay only." },
    { "id": 136, "text": "A single harmless star flits across the sky above you and twinkles once; decorative." },
    { "id": 137, "text": "A tiny music box pops out of your pack and plays a tune for 1 minute; decorative." },
    { "id": 138, "text": "The next nonmagical trinket you pick up sparkles faintly for 1 minute; decorative." },
    { "id": 139, "text": "Your next handshake feels unusually warm and friendly; roleplay only." },
    { "id": 140, "text": "A gentle gust rearranges a nearby person's hair into a humorous style for 1 minute; decorative." },
    { "id": 141, "text": "A tiny, harmless constellation appears on your palm for 1 hour; decorative." },
    { "id": 142, "text": "A small, polite chime plays when you open a door for the next minute; decorative." },
    { "id": 143, "text": "One small object in your pocket becomes covered in harmless, fragrant powder for 1 hour; decorative." },
    { "id": 144, "text": "A tiny, helpful breeze turns a small page of a book to the page you meant to read (DM determines usefulness)." },
    { "id": 145, "text": "A faint, friendly glow outlines your boots for 1 minute; decorative." },
    { "id": 146, "text": "Your next spoken nickname for an ally sounds particularly affectionate; roleplay only." },
    { "id": 147, "text": "A small drifting lantern appears beside you for 1 minute and moves with you; decorative." },
    { "id": 148, "text": "For 1 minute, your footsteps leave small, harmless footprints of a random tiny creature; decorative." },
    { "id": 149, "text": "A tiny, harmless shower of rose petals appears and drifts down for 1 minute; decorative." },
    { "id": 150, "text": "Your next short story told aloud becomes more dramatic; roleplay only." },
    { "id": 151, "text": "A small, harmless illusion of a dancing shoe appears and dances for 10 seconds; decorative." },
    { "id": 152, "text": "Your next attempt to impress a craftsperson is met with slight admiration; flavor only." },
    { "id": 153, "text": "A polite gust rearranges a scattered set of papers into a tidy pile within 5 feet; decorative." },
    { "id": 154, "text": "A tiny, friendly glow follows your fingers as you write for 1 minute; not bright enough to affect stealth." },
    { "id": 155, "text": "Your next small fire you start glows a pleasing color for 1 hour; decorative." },
    { "id": 156, "text": "A harmless little bell rings once when you set down an object in the next minute; decorative." },
    { "id": 157, "text": "A tiny, invisible perfume cloud follows you for 10 minutes; decorative." },
    { "id": 158, "text": "Your next spoken compliment is especially memorable; roleplay only." },
    { "id": 159, "text": "A small, harmless puff of snow falls in a 3-foot radius around you for 1 minute; it melts immediately." },
    { "id": 160, "text": "A tiny, friendly balloon appears and stays tied to your belt for 1 minute; decorative." },
    { "id": 161, "text": "Your next noncombat dance is particularly graceful; roleplay only." },
    { "id": 162, "text": "You and your nearest ally within 5 feet swap one minor, purely cosmetic accessory (hat, scarf) for 10 minutes." },
    { "id": 163, "text": "A tiny, harmless sparkle follows any food you eat for 1 minute; decorative." },
    { "id": 164, "text": "A small, polite owl hoots once in agreement with something you said; decorative." },
    { "id": 165, "text": "You briefly smell delightful; purely flavorful." },
    { "id": 166, "text": "A faint, friendly shimmer outlines one piece of clothing for 10 minutes; decorative." },
    { "id": 167, "text": "A tiny magical spark fizzles from your fingertips when you gesture for 1 minute; decorative." },
    { "id": 168, "text": "A harmless little star appears and points toward the nearest source of warmth for 1 minute; decorative." },
    { "id": 169, "text": "You briefly taste of exotic spices; purely flavorful." },
    { "id": 170, "text": "A single harmless firework pops gently overhead and fades immediately; decorative." },
    { "id": 171, "text": "A tiny, friendly breeze plays a short tune on a nearby wind chime for 10 seconds; decorative." },
    { "id": 172, "text": "Your next small joke lands especially well; roleplay only." },
    { "id": 173, "text": "A harmless blue glow outlines your fingertips for 1 minute; decorative." },
    { "id": 174, "text": "A tiny, polite bell appears on your ankle and rings softly for 1 minute; decorative." },
    { "id": 175, "text": "You briefly hear a chorus of distant frogs singing for 10 seconds; decorative." },
    { "id": 176, "text": "A small, harmless puff of glitter outlines the next letter you write for 1 minute; decorative." },
    { "id": 177, "text": "A tiny, friendly firefly circles your head and gives a little salute for 1 minute; decorative." },
    { "id": 178, "text": "Your next spoken word sounds slightly more charismatic; roleplay only." },
    { "id": 179, "text": "You momentarily smell of pine; decorative and pleasant." },
    { "id": 180, "text": "A harmless silver thread appears and ties a neat bow around your waist for 1 minute; decorative." },
    { "id": 181, "text": "You gain a tiny, harmless tattoo that fades in 1 hour; decorative." },
    { "id": 182, "text": "Your next small drawing animates for 10 seconds; decorative." },
    { "id": 183, "text": "A helpful, whispering breeze points toward the nearest exit for 10 seconds; DM determines usefulness." },
    { "id": 184, "text": "A tiny, friendly sparrow delivers a crumb to you and hops away; decorative." },
    { "id": 185, "text": "A soft, pleasant chime plays when you take a step for 1 minute; decorative." },
    { "id": 186, "text": "You briefly feel like a celebrated performer; roleplay only." },
    { "id": 187, "text": "A harmless little crown of light appears over your head and wobbles for 10 seconds; decorative." },
    { "id": 188, "text": "Your next small spoken rumor sounds particularly believable; roleplay only." },
    { "id": 189, "text": "Tiny harmless sparks dance across a nearby puddle for 1 minute; decorative." },
    { "id": 190, "text": "A little bell rings when you open a chest within 1 minute; decorative." },
    { "id": 191, "text": "Your next small spoken compliment is especially charming; roleplay only." },
    { "id": 192, "text": "A polite gust refolds a page in a book to the right paragraph for 10 seconds; decorative." },
    { "id": 193, "text": "A tiny, harmless halo hovers over one ally within 10 feet for 1 minute; decorative." },
    { "id": 194, "text": "Your next glance at a map makes one route seem clearer; roleplay only." },
    { "id": 195, "text": "A tiny friendly spark reveals the nearest signpost's direction for 10 seconds; decorative." },
    { "id": 196, "text": "You briefly smell of fresh ink; decorative and flavor-only." },
    { "id": 197, "text": "A small, harmless firefly lands on your finger and blinks for 1 minute; decorative." },
    { "id": 198, "text": "A soft, tiny drumroll accompanies your next short speech; decorative." },
    { "id": 199, "text": "A harmless sparkle forms the shape of a smile near you for 1 minute; decorative." },
    { "id": 200, "text": "A tiny gust rearranges embroidery on one nearby garment for 1 minute; decorative improvement." },
    { "id": 201, "text": "You gain 1 temporary hit point that lasts 1 minute." },
    { "id": 202, "text": "A small, harmless mote of light dances over your left shoulder for 1 minute." },
    { "id": 203, "text": "You feel unusually well-rested for 10 minutes; flavor-only energy boost." },
    { "id": 204, "text": "Your next short rest feels a touch more restorative; flavor only." },
    { "id": 205, "text": "A tiny, friendly echo applauds when you finish speaking for 10 seconds." },
    { "id": 206, "text": "A soft breeze cools you pleasantly for the next 10 minutes." },
    { "id": 207, "text": "Your next simple joke is particularly witty; roleplay only." },
    { "id": 208, "text": "A harmless sparkle decorates the nearest nonmagical trinket you hold for 1 minute; decorative." },
    { "id": 209, "text": "A tiny, polite crowd noise plays when you enter a room for 5 seconds; decorative." },
    { "id": 210, "text": "A single harmless feather drifts down and tickles your nose; decorative." },
    { "id": 211, "text": "The next small gift you give seems especially well-received; roleplay only." },
    { "id": 212, "text": "A tiny, glowing arrow points to the nearest bench or chair for 10 seconds; decorative." },
    { "id": 213, "text": "You briefly gain a pleasing hum that makes simple tasks feel calmer; flavor only." },
    { "id": 214, "text": "A small cluster of harmless lights hovers near you for 1 minute; decorative." },
    { "id": 215, "text": "A tiny, friendly voice offers a compliment to you and then fades; decorative." },
    { "id": 216, "text": "You emit a faint pleasant scent for 10 minutes; decorative and flavorful." },
    { "id": 217, "text": "A single harmless note rings out when you open a bottle; decorative." },
    { "id": 218, "text": "Your next seam or stitch holds a little better; flavor only." },
    { "id": 219, "text": "A small paper lantern floats near you for 30 seconds then vanishes; decorative." },
    { "id": 220, "text": "A tiny, harmless gust rustles nearby curtains in a pleasing way for 10 seconds." },
    { "id": 221, "text": "A delightful but harmless aroma of cookies follows you for 10 minutes." },
    { "id": 222, "text": "A tiny bell chimes softly when you begin a sentence for the next minute; decorative." },
    { "id": 223, "text": "A small, harmless bloom appears on the nearest potted plant for 1 minute." },
    { "id": 224, "text": "Your next short poem reads particularly well; roleplay only." },
    { "id": 225, "text": "A tiny, friendly ghost offers a thumbs-up and gently vanishes; decorative." },
    { "id": 226, "text": "A small, pleasant breeze follows you for 5 minutes; decorative." },
    { "id": 227, "text": "Your next found trinket seems a touch more interesting; DM discretion." },
    { "id": 228, "text": "A faint shimmer outlines the nearest book for 10 seconds; decorative." },
    { "id": 229, "text": "A tiny, harmless puddle forms a smiling face for 5 seconds and disappears." },
    { "id": 230, "text": "Your next handshake leaves a faint, pleasant scent of lavender; decorative." },
    { "id": 231, "text": "You gain 1 temporary hit point that lasts 1 minute." },
    { "id": 232, "text": "A small harmless glowing mote hovers near your shoulder for 1 minute." },
    { "id": 233, "text": "You briefly feel sprightly and alert for 10 minutes; purely flavorful." },
    { "id": 234, "text": "A tiny musical flourish accompanies your next flourish of magic (cosmetic)." },
    { "id": 235, "text": "A small, friendly gust cools a hot cup of tea for you; decorative." },
    { "id": 236, "text": "A faint trail of sparkles leads to the nearest useful object for 10 seconds; decorative." },
    { "id": 237, "text": "Your next minor culinary attempt tastes just a bit better; flavor only." },
    { "id": 238, "text": "A tiny note appears in your pocket that simply says \"Well done\" for 1 hour; decorative." },
  { "id": 239, "rarity": "Common", "text": "A polite gust turns a single page to the page you meant to read; DM discretion." },
  { "id": 240, "rarity": "Common", "text": "A single harmless sparkle outlines the nearest useful tool for 10 seconds; decorative." },
  { "id": 241, "rarity": "Uncommon", "text": "Your next short spoken story becomes more vivid; roleplay only." },
  { "id": 242, "rarity": "Uncommon", "text": "A tiny harmless songbird perches nearby and trills for 10 seconds; decorative." },
  { "id": 243, "rarity": "Uncommon", "text": "A small, friendly shadow forms a tiny heart for 10 seconds and fades." },
  { "id": 244, "rarity": "Uncommon", "text": "A faint pleasant scent of citrus follows you for 10 minutes; decorative." },
  { "id": 245, "rarity": "Uncommon", "text": "A tiny piece of confetti lands on your hat and stays for 1 minute; decorative." },
  { "id": 246, "rarity": "Uncommon", "text": "Your next small craft project feels slightly more satisfying; flavor only." },
  { "id": 247, "rarity": "Uncommon", "text": "A friendly whisper of encouragement brushes past you for 10 seconds; decorative." },
  { "id": 248, "rarity": "Uncommon", "text": "A tiny harmless glow marks the nearest exit for 10 seconds; decorative." },
  { "id": 249, "rarity": "Uncommon", "text": "A small harmless ribbon ties itself on the nearest gift for 1 minute; decorative." },
  { "id": 250, "rarity": "Uncommon", "text": "A tiny friendly tune plays when you put down an object for 5 seconds; decorative." },
  { "id": 251, "rarity": "Uncommon", "text": "A polite breeze flips a page to reveal a reassuring quote (DM discretion)." },
  { "id": 252, "rarity": "Uncommon", "text": "A tiny harmless glow outlines the nearest keyhole for 10 seconds; decorative." },
  { "id": 253, "rarity": "Uncommon", "text": "A single harmless bubble forms and floats away when you laugh; decorative." },
  { "id": 254, "rarity": "Uncommon", "text": "A faint, pleasant hum follows your next sentence for 10 seconds; decorative." },
  { "id": 255, "rarity": "Uncommon", "text": "A small, harmless light dances on your fingertips for 1 minute; decorative." },
  { "id": 256, "rarity": "Uncommon", "text": "A tiny friendly breeze carries the scent of distant flowers for 10 minutes; decorative." },
  { "id": 257, "rarity": "Uncommon", "text": "Your next small repair seems to hold a little better; flavor only." },
  { "id": 258, "rarity": "Uncommon", "text": "A tiny harmless sparkle briefly highlights the nearest helpful signpost for 10 seconds." },
  { "id": 259, "rarity": "Uncommon", "text": "A polite chime sounds when you step into a room for the next 5 seconds; decorative." },
  { "id": 260, "rarity": "Uncommon", "text": "A small harmless feather floats by and settles on your sleeve, then vanishes." },
  { "id": 261, "rarity": "Uncommon", "text": "You gain 1 temporary hit point that lasts 1 minute." },
  { "id": 262, "rarity": "Uncommon", "text": "A tiny decorative moth flutters around your lantern for 1 minute; decorative." },
  { "id": 263, "rarity": "Uncommon", "text": "A small burst of harmless colored sparkles appears when you clap; decorative." },
  { "id": 264, "rarity": "Uncommon", "text": "Your next short phrase sounds particularly memorable; roleplay only." },
  { "id": 265, "rarity": "Uncommon", "text": "A tiny friendly glow follows your pen when you write for 1 minute; decorative." },
  { "id": 266, "rarity": "Uncommon", "text": "A small playful breeze tousles your hair charmingly for 10 seconds; decorative." },
  { "id": 267, "rarity": "Uncommon", "text": "A miniature paper hat appears on a nearby inanimate object for 1 minute; decorative." },
  { "id": 268, "rarity": "Uncommon", "text": "A tiny harmless sparkle outlines the nearest helpful shelf for 10 seconds; decorative." },
  { "id": 269, "rarity": "Uncommon", "text": "A small, pleasant scent of herbs wafts from your satchel for 10 minutes; decorative." },
  { "id": 270, "rarity": "Uncommon", "text": "A tiny, friendly cheep from an unseen bird acknowledges you for 5 seconds; decorative." },
  { "id": 271, "rarity": "Rare", "text": "A faint shimmer outlines the nearest path for 5 seconds; decorative." },
  { "id": 272, "rarity": "Rare", "text": "Your next small toast is particularly well-received; roleplay only." },
  { "id": 273, "rarity": "Rare", "text": "A tiny harmless spark forms a smile on the nearest smooth surface for 5 seconds." },
  { "id": 274, "rarity": "Rare", "text": "A little confetti puff appears when you nod and then drifts away; decorative." },
  { "id": 275, "rarity": "Rare", "text": "Your next small craft looks a touch more polished; flavor only." },
  { "id": 276, "rarity": "Rare", "text": "A tiny harmless glow marks the nearest helpful lever for 10 seconds; decorative." },
  { "id": 277, "rarity": "Rare", "text": "A small, polite bell rings softly when you say someone's name for the next minute; decorative." },
  { "id": 278, "rarity": "Rare", "text": "A tiny, friendly hush falls over nearby chatter for 3 seconds when you begin to tell a story; decorative." },
  { "id": 279, "rarity": "Rare", "text": "A single harmless bubble pops with a soft musical note when you speak; decorative." },
  { "id": 280, "rarity": "Rare", "text": "A small harmless sparkle forms a heart shape in the air for 5 seconds; decorative." },
  { "id": 281, "rarity": "Rare", "text": "A tiny note appears on your palm that says \"Good luck\" and fades in 10 seconds; decorative." },
  { "id": 282, "rarity": "Rare", "text": "A fleeting shadow puppetry scene plays on a nearby wall for 10 seconds; decorative." },
  { "id": 283, "rarity": "Rare", "text": "A tiny harmless echo of laughter follows you for 10 seconds after you laugh; decorative." },
  { "id": 284, "rarity": "Rare", "text": "A small, warm glow outlines the nearest comfortable chair for 10 seconds; decorative." },
  { "id": 285, "rarity": "Rare", "text": "A tiny harmless sprite brushes lint off your sleeve and vanishes; decorative." },
  { "id": 286, "rarity": "Rare", "text": "A single harmless star twinkles over your head for 5 seconds and disappears." },
  { "id": 287, "rarity": "Rare", "text": "A faint pleasant scent of vanilla follows you for 10 minutes; decorative." },
  { "id": 288, "rarity": "Rare", "text": "A tiny harmless bell rings once when you complete a sentence; decorative." },
  { "id": 289, "rarity": "Rare", "text": "A small decorative ribbon appears on your belt for 1 minute and then vanishes." },
  { "id": 290, "rarity": "Rare", "text": "A tiny, harmless sparkle appears on the nearest lamp for 10 seconds; decorative." },
    { "id": 291, "rarity": "Legendary", "text": "You cast Fireball (3rd-level) centered on a point you can see within 150 feet; it requires no components or spell slot." },
    { "id": 292, "rarity": "Legendary", "text": "You cast Lightning Bolt (3rd-level) in a 100-foot line you choose; it requires no components or spell slot." },
    { "id": 293, "rarity": "Legendary", "text": "You gain one extra action this turn. This action can be used to take the Attack (one weapon attack), Dash, Disengage, Hide, Use an Object, or cast a cantrip." },
    { "id": 294, "rarity": "Legendary", "text": "Allies you choose within 30 feet immediately regain hit points equal to their hit point maximum (they are healed to full)." },
    { "id": 295, "rarity": "Legendary", "text": "Until the start of your next turn, you have resistance to all damage and advantage on saving throws." },
    { "id": 296, "rarity": "Legendary", "text": "Your next attack or spell that deals damage before the end of your next turn deals maximum damage." },
    { "id": 297, "rarity": "Legendary", "text": "As a bonus action this turn, you can teleport to any unoccupied space you can see within 120 feet." },
    { "id": 298, "rarity": "Legendary", "text": "A spectral guardian shields your group for 1 minute; as a reaction (once per round), it imposes disadvantage on one attack against you or an ally within 10 feet." },
    { "id": 299, "rarity": "Legendary", "text": "You gain a 60-foot flying speed for 1 minute." },
    { "id": 300, "rarity": "Legendary", "text": "You immediately regain all expended spell slots of 3rd level and lower." }
  ],
  "legendaryIds": [291, 292, 293, 294, 295, 296, 297, 298, 299, 300]
}