{
  "effects": [
    { "id": 1, "text": "You explode in a burst of harmless glitter; all creatures within 10 feet are blinded until the end of their next turn." },
    { "id": 2, "text": "You take 2d10 force damage as chaotic energy surges through you." },
    { "id": 3, "text": "You are polymorphed into a sheep for 1 minute (DC 15 Wisdom save ends early)." },
    { "id": 4, "text": "You are stunned until the start of your next turn as your mind blanks out in cosmic static." },
    { "id": 5, "text": "You cast Fireball centered on yourself." },
    { "id": 6, "text": "Your clothes vanish for 1 minute. Embarrassing, but not harmful." },
    { "id": 7, "text": "You and one random creature within 30 feet swap places." },
    { "id": 8, "text": "You fall prone and your legs turn into jelly for 1 round." },
    { "id": 9, "text": "Your skin becomes translucent, revealing your organs for 1 hour. Disadvantage on Charisma checks." },
    { "id": 10, "text": "A spectral hand slaps you for 1d6 bludgeoning damage and disappears." },
    { "id": 11, "text": "You become intensely magnetic for 1 minute; metal objects stick to you." },
    { "id": 12, "text": "You are frightened of your own shadow for 1 minute." },
    { "id": 13, "text": "You emit the smell of rotten eggs for 24 hours." },
    { "id": 14, "text": "A random ally within 30 feet takes 1d8 lightning damage as sparks jump between you." },
    { "id": 15, "text": "Your arms shrink to half their normal length for 1 hour." },
    { "id": 16, "text": "You can’t speak for 1 minute; instead, bubbles float from your mouth when you try." },
    { "id": 17, "text": "You are surrounded by illusory spiders crawling on your body for 1 minute." },
    { "id": 18, "text": "You sneeze uncontrollably for 1 minute, unable to take the Attack action." },
    { "id": 19, "text": "Your shadow whispers insults for the next hour. Disadvantage on Stealth checks." },
    { "id": 20, "text": "You are poisoned for 1 minute as your stomach churns with magic." },
    { "id": 21, "text": "The nearest unattended object animates and tries to bite you (AC 10, 1 HP)." },
    { "id": 22, "text": "Your hair catches fire (harmlessly) for 1 minute; you can’t extinguish it." },
    { "id": 23, "text": "You become invisible for 1 round and reappear 10 feet in a random direction." },
    { "id": 24, "text": "Your hands emit harmless smoke for 10 minutes." },
    { "id": 25, "text": "A chorus of ghostly voices sing your name ominously for 30 seconds." },
    { "id": 26, "text": "You and one random creature exchange memories of the last 24 hours." },
    { "id": 27, "text": "You lose 1d4 teeth, replaced instantly with tiny glowing gems." },
    { "id": 28, "text": "A random creature within 30 feet polymorphs into a frog for 1 minute (save negates)." },
    { "id": 29, "text": "For 1 minute, everything you touch turns to soft clay." },
    { "id": 30, "text": "You age 1d10 years instantly." },
    { "id": 31, "text": "You regain 1d10 years of youth instantly." },
    { "id": 32, "text": "A localized thunderclap knocks everyone within 10 feet prone." },
    { "id": 33, "text": "You emit light like a torch, but the light flickers and whispers unsettling phrases." },

    { "id": 34, "text": "A random song plays loudly around you for 1 minute." },
    { "id": 35, "text": "You levitate 10 feet off the ground for 10 seconds, then drop safely." },
    { "id": 36, "text": "A harmless illusion of a dragon swoops overhead and roars." },
    { "id": 37, "text": "Your skin turns plaid for 1 hour." },
    { "id": 38, "text": "A chicken appears and follows you for the next 24 hours." },
    { "id": 39, "text": "For 1 minute, any creature that touches you becomes slightly static-shocked." },
    { "id": 40, "text": "Your voice becomes booming and divine for 1 hour." },
    { "id": 41, "text": "All nearby flames turn blue for 10 minutes." },
    { "id": 42, "text": "You are surrounded by spectral butterflies for 1 minute." },
    { "id": 43, "text": "A gentle raincloud appears above your head, following you for 1 minute." },
    { "id": 44, "text": "Your shadow performs interpretive dance for 1 minute." },
    { "id": 45, "text": "You sprout feathers instead of hair for 24 hours." },
    { "id": 46, "text": "You speak only in rhyme for 10 minutes." },
    { "id": 47, "text": "You teleport 10 feet into an unoccupied space of your choice." },
    { "id": 48, "text": "Your next spell casts silently, even if it normally has verbal components." },
    { "id": 49, "text": "Your fingertips glow like candles for 1 hour." },
    { "id": 50, "text": "You are compelled to dance uncontrollably for 1 round." },
    { "id": 51, "text": "An illusory halo appears above your head for 1 hour." },
    { "id": 52, "text": "You can speak one random language fluently for 10 minutes." },
    { "id": 53, "text": "All food within 30 feet becomes perfectly seasoned." },
    { "id": 54, "text": "Your next attack roll automatically hits, but deals minimum damage." },
    { "id": 55, "text": "A harmless floating eye follows you for 1 hour, mimicking your expressions." },
    { "id": 56, "text": "You briefly glow with starlight; creatures within 5 feet make a DC 13 Con save or be blinded until your next turn." },
    { "id": 57, "text": "You summon a random harmless beast (DM chooses) for 1 minute." },
    { "id": 58, "text": "All ink within 10 feet turns invisible for 1 hour." },
    { "id": 59, "text": "You grow a small horn that hums softly when magic is nearby." },
    { "id": 60, "text": "You are surrounded by faint music that only you can hear." },
    { "id": 61, "text": "A minor illusion of your ideal self appears beside you for 1 minute." },
    { "id": 62, "text": "The air temperature around you shifts by 10 degrees in your favor for 1 hour." },
    { "id": 63, "text": "A spectral butler appears and politely hands you a drink." },
    { "id": 64, "text": "For 1 minute, small flowers bloom where you step." },
    { "id": 65, "text": "You gain darkvision out to 60 feet for 1 hour." },
    { "id": 66, "text": "A golden aura surrounds you, granting advantage on saving throws against fear for 1 minute." },

    { "id": 67, "text": "You gain 10 temporary hit points." },
    { "id": 68, "text": "Your next spell is automatically cast at one level higher without consuming an extra slot." },
    { "id": 69, "text": "A spectral shield hovers near you, granting +2 AC for 1 minute." },
    { "id": 70, "text": "You gain resistance to one random damage type for 1 hour." },
    { "id": 71, "text": "You immediately regain one expended spell slot of 3rd level or lower." },
    { "id": 72, "text": "You gain advantage on all attack rolls until the end of your next turn." },
    { "id": 73, "text": "You teleport up to 30 feet to an unoccupied space you can see." },
    { "id": 74, "text": "For 1 minute, you can see invisible creatures and objects." },
    { "id": 75, "text": "You can fly (20 ft speed) for 1 minute." },
    { "id": 76, "text": "Your movement speed doubles for 1 minute." },
    { "id": 77, "text": "You regain all hit points lost in the last 10 minutes." },
    { "id": 78, "text": "You gain truesight out to 30 feet for 1 minute." },
    { "id": 79, "text": "You gain the benefit of the 'Bless' spell for 1 minute." },
    { "id": 80, "text": "Your body briefly becomes ethereal, letting you move through walls for 6 seconds." },
    { "id": 81, "text": "You summon a harmless celestial spirit that follows you for 1 hour and hums pleasantly." },
    { "id": 82, "text": "Your spell save DC increases by +2 for the next 10 minutes." },
    { "id": 83, "text": "You gain a burst of insight — learn one hidden fact about your surroundings (DM discretion)." },
    { "id": 84, "text": "All allies within 30 feet gain 1d8 temporary hit points." },
    { "id": 85, "text": "You are immune to being frightened for the next hour." },
    { "id": 86, "text": "You can teleport up to 1 mile to a location you can visualize once within the next 10 minutes." },
    { "id": 87, "text": "You cast Mirror Image centered on yourself without using a spell slot." },
    { "id": 88, "text": "You gain resistance to all damage for 1 round." },
    { "id": 89, "text": "You gain the effects of the Haste spell for 1 minute." },
    { "id": 90, "text": "You summon a spectral familiar that obeys you for 1 hour." },
    { "id": 91, "text": "You can immediately cast one 1st-level spell you know without expending a slot or components." },
    { "id": 92, "text": "Your next critical hit deals maximum possible damage." },
    { "id": 93, "text": "For 1 minute, you emit bright light in a 20-foot radius that heals allies 1 HP each round." },
    { "id": 94, "text": "A shimmering aura surrounds you; allies within 10 feet have advantage on saving throws for 1 minute." },
    { "id": 95, "text": "You gain the ability to cast one random spell of 5th level or lower once in the next 24 hours." },
    { "id": 96, "text": "Your next failed saving throw is instead treated as a success." },
    { "id": 97, "text": "A celestial choir sings your name; all allies regain 2d10 hit points." },
    { "id": 98, "text": "You gain a +2 bonus to all rolls for the next hour." },
    { "id": 99, "text": "You are surrounded by divine energy — for 1 minute, all attacks against you have disadvantage." },
    { "id": 100, "text": "You ascend briefly, levitating in radiant light; for 1 minute, you gain flight, resistance to all damage, and your next spell automatically succeeds." }
  ]
}