{
  "effects": [
    { "id": 1, "category": "narrative", "rarity": "Common", "text": "A soft breeze carries the scent of fresh citrus around you." },
    { "id": 2, "category": "narrative", "rarity": "Common", "text": "Tiny motes of light dance in the air near your hands for a moment." },
    { "id": 3, "category": "narrative", "rarity": "Common", "text": "Your voice gains a pleasant echo that makes stories sound grander." },
    { "id": 4, "category": "narrative", "rarity": "Common", "text": "A faint melody hums around you, brightening the mood." },
    { "id": 5, "category": "narrative", "rarity": "Common", "text": "A single, harmless bubble of colored light floats above your palm and pops." },
    { "id": 6, "category": "narrative", "rarity": "Common", "text": "Your handwriting curls into decorative flourishes for a short while." },
    { "id": 7, "category": "narrative", "rarity": "Common", "text": "A tiny banner unfurls that reads a cheerful word in an unfamiliar script." },
    { "id": 8, "category": "narrative", "rarity": "Common", "text": "A warm, pleasant scent of cinnamon wafts from your clothing." },
    { "id": 9, "category": "narrative", "rarity": "Common", "text": "A friendly chime rings softly when you finish a sentence." },
    { "id": 10, "category": "narrative", "rarity": "Common", "text": "A tiny paper bird flutters from your sleeve and hovers for a moment." },
    { "id": 11, "category": "narrative", "rarity": "Common", "text": "A speckled glow traces the margin of the nearest page you look at." },
    { "id": 12, "category": "narrative", "rarity": "Common", "text": "Your breath forms harmless little stars that shimmer and fade." },
    { "id": 13, "category": "narrative", "rarity": "Common", "text": "A contented sigh seems to linger in the air like a tiny cloud." },
    { "id": 14, "category": "narrative", "rarity": "Common", "text": "A soft glow outlines your favorite pen or quill for a short while." },
    { "id": 15, "category": "narrative", "rarity": "Common", "text": "A faint perfume of lavender follows you for a few minutes." },
    { "id": 16, "category": "narrative", "rarity": "Common", "text": "A small, friendly tune seems to accompany your steps briefly." },
    { "id": 17, "category": "narrative", "rarity": "Common", "text": "Tiny ribbons of color drift from your sleeves and vanish." },
    { "id": 18, "category": "narrative", "rarity": "Common", "text": "A mild, pleasant glow makes your books look slightly more inviting." },
    { "id": 19, "category": "narrative", "rarity": "Common", "text": "A soft bell sound rings when you smile; it's warm and friendly." },
    { "id": 20, "category": "narrative", "rarity": "Common", "text": "Your laugh leaves harmless glittering motes that float briefly." },
    { "id": 21, "category": "narrative", "rarity": "Common", "text": "A little note appears on your hand with a friendly doodle and then fades." },
    { "id": 22, "category": "narrative", "rarity": "Common", "text": "A faint aroma of baked bread surrounds you for a moment." },
    { "id": 23, "category": "narrative", "rarity": "Common", "text": "A tiny star spins slowly above your head and winks out." },
    { "id": 24, "category": "narrative", "rarity": "Common", "text": "A small, harmless shimmer outlines a nearby chair making it look inviting." },
    { "id": 25, "category": "narrative", "rarity": "Common", "text": "A soft hum seems to make conversations feel more engaging." },
    { "id": 26, "category": "narrative", "rarity": "Common", "text": "A single leaf twirls gently by you and glows faintly before fading." },
    { "id": 27, "category": "narrative", "rarity": "Common", "text": "Your clothing gains a tiny decorative stitch that sparkles then dims." },
    { "id": 28, "category": "narrative", "rarity": "Common", "text": "A quiet birdlike trill follows your voice for a few moments." },
    { "id": 29, "category": "narrative", "rarity": "Common", "text": "A small shimmer makes the nearest candle flame flicker in pleasant colors." },
    { "id": 30, "category": "narrative", "rarity": "Common", "text": "A faint, friendly echo answers a joke you tell, making it sound funnier." },
    { "id": 31, "category": "narrative", "rarity": "Common", "text": "Your pocket feels slightly warmer for a short while; comforting." },
    { "id": 32, "category": "narrative", "rarity": "Common", "text": "A tiny glowing mote rests on your shoulder and then floats away." },
    { "id": 33, "category": "narrative", "rarity": "Common", "text": "A harmless swirl of colorful confetti drifts around your feet then fades." },
    { "id": 34, "category": "narrative", "rarity": "Common", "text": "A soft, contented sigh seems to come from nowhere and settles the mood." },
    { "id": 35, "category": "narrative", "rarity": "Common", "text": "Small sparkles trail briefly behind your hand as you gesture." },
    { "id": 36, "category": "narrative", "rarity": "Common", "text": "A tiny, harmless image of a smiling face appears on your palm and vanishes." },
    { "id": 37, "category": "narrative", "rarity": "Common", "text": "Your words seem to carry a touch more warmth for a short spell." },
    { "id": 38, "category": "narrative", "rarity": "Common", "text": "A mild shimmer decorates the rim of the nearest cup, making tea taste nicer." },
    { "id": 39, "category": "narrative", "rarity": "Common", "text": "A tiny harmless glow outlines your favorite hat for a short while." },
    { "id": 40, "category": "narrative", "rarity": "Common", "text": "A faint scent of citrus brightens the air around you." },
    { "id": 41, "category": "narrative", "rarity": "Common", "text": "A small cluster of harmless lights dances near your feet then fades." },
    { "id": 42, "category": "narrative", "rarity": "Common", "text": "A tiny, friendly tune plays in your head for a few seconds." },
    { "id": 43, "category": "narrative", "rarity": "Common", "text": "Your handwriting briefly sparkles, making notes feel special." },
    { "id": 44, "category": "narrative", "rarity": "Common", "text": "A single harmless feather drifts by and settles on your sleeve." },
    { "id": 45, "category": "narrative", "rarity": "Common", "text": "A polite chuckle seems to ripple through the nearby air when you smile." },
    { "id": 46, "category": "narrative", "rarity": "Common", "text": "A tiny glimmer outlines a nearby notebook's cover for a short while." },
    { "id": 47, "category": "narrative", "rarity": "Common", "text": "A pleasant, harmless glow makes simple items look a touch more charming." },
    { "id": 48, "category": "narrative", "rarity": "Common", "text": "A tiny, decorative ribbon appears on a nearby accessory and then fades." },
    { "id": 49, "category": "narrative", "rarity": "Common", "text": "A faint, pleasant scent of herbs seems to follow you briefly." },
    { "id": 50, "category": "narrative", "rarity": "Common", "text": "A harmless shimmer outlines a nearby coin making it glitter faintly." },
    { "id": 51, "category": "narrative", "rarity": "Uncommon", "text": "Your voice briefly carries a persuasive undertone that draws attention." },
    { "id": 52, "category": "narrative", "rarity": "Uncommon", "text": "A comforting aura makes nearby allies feel a little more at ease (flavor)." },
    { "id": 53, "category": "narrative", "rarity": "Uncommon", "text": "A small mark of good luck appears on your palm and stays for a short while." },
    { "id": 54, "category": "narrative", "rarity": "Uncommon", "text": "A brief, vivid memory of home fills you with calm and clarity." },
    { "id": 55, "category": "narrative", "rarity": "Uncommon", "text": "A single line of poetry forms in your head, inspiring your next tale." },
    { "id": 56, "category": "narrative", "rarity": "Uncommon", "text": "A small spark of insight brightens your thoughts; roleplay advantage on a simple recall." },
    { "id": 57, "category": "narrative", "rarity": "Uncommon", "text": "A helpful mental note reminds you of a trivial detail you recently noticed." },
    { "id": 58, "category": "narrative", "rarity": "Uncommon", "text": "A soft voice in your head suggests a witty reply; roleplay only." },
    { "id": 59, "category": "narrative", "rarity": "Uncommon", "text": "A pleasant image settles in your mind and steadies you for a moment." },
    { "id": 60, "category": "narrative", "rarity": "Uncommon", "text": "A faint shimmer outlines a hidden seam, revealing a simple latch or loose stone within 30 feet (DM chooses)." },
    { "id": 61, "category": "narrative", "rarity": "Uncommon", "text": "A neighborly whisper offers a tip that makes a choice clearer; roleplay only." },
    { "id": 62, "category": "narrative", "rarity": "Uncommon", "text": "A gentle glow makes your next small art or craft project look more polished." },
    { "id": 63, "category": "narrative", "rarity": "Uncommon", "text": "A cryptic couplet whispers a clue about a nearby obstacle; the DM provides a short hint relevant to the current scene." },
    { "id": 64, "category": "narrative", "rarity": "Uncommon", "text": "A small token of fondness appears in your pocket and feels sincere." },
    { "id": 65, "category": "narrative", "rarity": "Uncommon", "text": "A brief flash of inspiration improves the flavor of your next minor creation." },
    { "id": 66, "category": "narrative", "rarity": "Uncommon", "text": "A calm presence eases tensions around you for a short while; roleplay only." },
    { "id": 67, "category": "narrative", "rarity": "Uncommon", "text": "A tiny charm gently clinks in your pocket with a reassuring tone." },
    { "id": 68, "category": "narrative", "rarity": "Uncommon", "text": "A soft lantern-like glow makes a small map easier to read (flavor)." },
    { "id": 69, "category": "narrative", "rarity": "Uncommon", "text": "Words appear in the air for a moment: a brief omen or direction related to your goal (DM supplies the message)." },
    { "id": 70, "category": "narrative", "rarity": "Uncommon", "text": "A gentle, encouraging murmur helps you organize your thoughts; roleplay only." },
    { "id": 71, "category": "narrative", "rarity": "Uncommon", "text": "A harmless symbol for good fortune glows briefly on your palm." },
    { "id": 72, "category": "narrative", "rarity": "Uncommon", "text": "A small sound like distant applause follows your next kind word; decorative." },
    { "id": 73, "category": "narrative", "rarity": "Uncommon", "text": "An illusory arrow overlays a safe route to the nearest nonmagical exit or shelter (DM determines the path)." },
    { "id": 74, "category": "narrative", "rarity": "Uncommon", "text": "A tiny quiet bell rings and you feel a momentary calm focus." },
    { "id": 75, "category": "narrative", "rarity": "Uncommon", "text": "A gentle gust brings a faint scent that sparks a pleasant memory." },
    { "id": 76, "category": "narrative", "rarity": "Uncommon", "text": "A small glowing glyph appears on your notebook, improving a sketch's look." },
    { "id": 77, "category": "narrative", "rarity": "Uncommon", "text": "You receive a vivid flash of a useful face or landmark nearby; the DM may introduce a friendly contact or recognizable sign." },
    { "id": 78, "category": "narrative", "rarity": "Uncommon", "text": "A tiny, helpful thought suggests a safer route in conversation; roleplay hint." },
    { "id": 79, "category": "narrative", "rarity": "Uncommon", "text": "A pleasant little tune plays in the background of your next line of prose, enhancing it." },
    { "id": 80, "category": "narrative", "rarity": "Uncommon", "text": "A soft shimmer makes your cloak look slightly more impressive for a short while." },
    { "id": 81, "category": "narrative", "rarity": "Rare", "text": "One sealed nonmagical container or drawer within 30 feet pops open harmlessly, revealing its mundane contents." },
    { "id": 82, "category": "narrative", "rarity": "Rare", "text": "A nearby lock clicks faintly if it is trapped or tampered with; you learn whether one chosen nonmagical lock within 30 feet is trapped." },
    { "id": 83, "category": "narrative", "rarity": "Rare", "text": "A hidden compartment or loose floorboard within 15 feet creaks audibly, hinting at a stashed item or clue." },
    { "id": 84, "category": "narrative", "rarity": "Rare", "text": "The sound of a distant lock turning echoes around you; one nonmagical lock of the DM’s choice within the current scene unlocks." },
    { "id": 85, "category": "narrative", "rarity": "Rare", "text": "Recent tracks within 30 feet glow faintly for 1 minute; you have advantage on Wisdom (Perception or Survival) checks to follow them." },
    { "id": 86, "category": "narrative", "rarity": "Rare", "text": "You recall a password, sign, or local custom that eases passage here; the DM provides a small social key that opens a minor door or favor." },
    { "id": 87, "category": "narrative", "rarity": "Rare", "text": "An NPC who owes you a kindness thinks of you; the DM may introduce a messenger, note, or chance meeting with a helpful tip." },
    { "id": 88, "category": "narrative", "rarity": "Rare", "text": "A nearby door, drawer, or window hums softly if something unusual lies beyond it (DM indicates one such point within 30 feet)." },
    { "id": 89, "category": "narrative", "rarity": "Rare", "text": "A neutral bystander or passerby takes a friendly interest and offers a small lead, rumor, or shortcut (DM provides one useful tidbit)." },
    { "id": 90, "category": "narrative", "rarity": "Rare", "text": "A folded scrap marked with a symbol appears in your pocket; it points toward the next point of interest (DM clarifies how)." },
    { "id": 91, "category": "narrative", "rarity": "Rare", "text": "You glimpse one likely consequence; the DM honestly answers one yes/no question about the current social situation." },
    { "id": 92, "category": "narrative", "rarity": "Rare", "text": "A harmless spectral key appears and points toward the nearest locked, unopened nonmagical door within 60 feet." },
    { "id": 93, "category": "narrative", "rarity": "Rare", "text": "Fog parts or sunlight pierces briefly to reveal a hidden landmark or sign in the area (DM chooses what is revealed)." },
    { "id": 94, "category": "narrative", "rarity": "Rare", "text": "An illusory signpost appears for 1 minute with a single enigmatic word chosen by the DM, hinting at a direction or theme." },
    { "id": 95, "category": "narrative", "rarity": "Rare", "text": "A tiny, harmless animal guide appears and tries to lead you somewhere interesting for 10 minutes (DM decides where)." },
    { "id": 96, "category": "narrative", "rarity": "Legendary", "text": "You cast *Fireball* (3rd-level) centered on a point you can see within 150 feet; it requires no components or spell slot." },
    { "id": 97, "category": "narrative", "rarity": "Legendary", "text": "You cast *Lightning Bolt* (3rd-level) in a 100-foot line you choose; it requires no components or spell slot." },
    { "id": 98, "category": "narrative", "rarity": "Legendary", "text": "You gain one extra action this turn. This action can be used to take the Attack (one weapon attack), Dash, Disengage, Hide, Use an Object, or cast a cantrip." },
    { "id": 99, "category": "narrative", "rarity": "Legendary", "text": "Allies you choose within 30 feet immediately regain hit points equal to their hit point maximum (they are healed to full)." },
    { "id": 100, "category": "narrative", "rarity": "Legendary", "text": "You immediately regain all expended spell slots of 3rd level and lower." }
  ,
    { "id": 101, "category": "general", "rarity": "Common", "text": "A harmless spark flickers from your weapon, creating a loud but harmless pop." },
    { "id": 102, "category": "general", "rarity": "Common", "text": "You feel a quick jolt of alertness that steadies your aim for a moment (flavor)." },
    { "id": 103, "category": "general", "rarity": "Common", "text": "Your boots make a crisp sound that sharpens your footing briefly." },
    { "id": 104, "category": "general", "rarity": "Common", "text": "A tiny burst of harmless light marks your target for a second; decorative." },
    { "id": 105, "category": "general", "rarity": "Common", "text": "A polite gust cools your brow and keeps you focused during the fray (flavor)." },
    { "id": 106, "category": "general", "rarity": "Common", "text": "A faint ringing makes your next quick shout sound more commanding." },
    { "id": 107, "category": "general", "rarity": "Common", "text": "Your grip feels marginally firmer for an instant; purely cosmetic but reassuring." },
    { "id": 108, "category": "general", "rarity": "Common", "text": "Small motes swirl around your weapon and then dissipate." },
    { "id": 109, "category": "general", "rarity": "Common", "text": "A harmless shimmer outlines your shield briefly, making it look sturdier." },
    { "id": 110, "category": "general", "rarity": "Common", "text": "A quick, imaginary cheer echoes, raising your spirits slightly (flavor)." },
    { "id": 111, "category": "general", "rarity": "Common", "text": "A tiny flash marks your boots with a symbol for a moment; decorative." },
    { "id": 112, "category": "general", "rarity": "Common", "text": "You feel a brief pulse of adrenaline; roleplay boost only." },
    { "id": 113, "category": "general", "rarity": "Common", "text": "A soft clang sounds when your weapon swings, oddly melodic but harmless." },
    { "id": 114, "category": "general", "rarity": "Common", "text": "Your posture straightens and you feel slightly more confident in combat." },
    { "id": 115, "category": "general", "rarity": "Common", "text": "A tiny ember flares on your gauntlet then dies out; decorative." },
    { "id": 116, "category": "general", "rarity": "Common", "text": "A small breeze helps you steady a thrown weapon; flavor only." },
    { "id": 117, "category": "general", "rarity": "Common", "text": "A harmless flicker of light traces your weapon's arc for a second." },
    { "id": 118, "category": "general", "rarity": "Common", "text": "Your shout carries with extra gusto; purely theatrical." },
    { "id": 119, "category": "general", "rarity": "Common", "text": "A quick pulse in your limbs makes your next minor movement feel brisker." },
    { "id": 120, "category": "general", "rarity": "Common", "text": "A harmless sparkles trail from your steps, marking your path for a moment." },
    { "id": 121, "category": "general", "rarity": "Common", "text": "A brief, harmless shimmer outlines a nearby rock, making it easier to see (flavor)." },
    { "id": 122, "category": "general", "rarity": "Common", "text": "A small, encouraging tap seems to land on your shoulder as if from nowhere." },
    { "id": 123, "category": "general", "rarity": "Common", "text": "A tiny spark flickers at the edge of your vision; it fades without effect." },
    { "id": 124, "category": "general", "rarity": "Common", "text": "You feel a crispness in the air that heightens your senses slightly." },
    { "id": 125, "category": "general", "rarity": "Common", "text": "A small note of triumph seems to play when you make an aggressive gesture." },
    { "id": 126, "category": "general", "rarity": "Common", "text": "A harmless ripple of light traces the edge of your blade for a beat." },
    { "id": 127, "category": "general", "rarity": "Common", "text": "Your breathing syncs in a satisfying way, aiding focus (flavor)." },
    { "id": 128, "category": "general", "rarity": "Common", "text": "A small emblem briefly shines on your armor, then dulls." },
    { "id": 129, "category": "general", "rarity": "Common", "text": "A faint drumbeat seems to follow you, keeping a steady rhythm." },
    { "id": 130, "category": "general", "rarity": "Common", "text": "A whisper of wind cools a heated blade, purely cosmetic." },
    { "id": 131, "category": "general", "rarity": "Common", "text": "A tiny flash of harmless light darts along your shield's rim." },
    { "id": 132, "category": "general", "rarity": "Common", "text": "Your next quick motion feels slightly more precise; flavor only." },
    { "id": 133, "category": "general", "rarity": "Common", "text": "A small, friendly caw from an unseen bird punctuates the clash of steel." },
    { "id": 134, "category": "general", "rarity": "Common", "text": "A brief gleam traces a useful seam in armor, making it look tidy." },
    { "id": 135, "category": "general", "rarity": "Common", "text": "A harmless spark dances along your gauntlet and then disappears." },
    { "id": 136, "category": "general", "rarity": "Common", "text": "A small echo of encouragement reaches you just when you need it; roleplay boost." },
    { "id": 137, "category": "general", "rarity": "Common", "text": "A short, bright sound rings when you strike, pleasing to the ear." },
    { "id": 138, "category": "general", "rarity": "Common", "text": "A tiny shimmer shows the edge of your sword for a split second." },
    { "id": 139, "category": "general", "rarity": "Common", "text": "A quick, harmless gust steadies you as you plant your feet." },
    { "id": 140, "category": "general", "rarity": "Common", "text": "A faint glow marks a small notch on a weapon, decorative only." },
    { "id": 141, "category": "general", "rarity": "Common", "text": "A little drumroll plays in the air briefly when you take decisive action." },
    { "id": 142, "category": "general", "rarity": "Common", "text": "A tiny flare decorates your helm then fades; harmless." },
    { "id": 143, "category": "general", "rarity": "Common", "text": "A small, warm glow makes your gauntlets feel comfortable for a moment." },
    { "id": 144, "category": "general", "rarity": "Common", "text": "A brief tingle in your fingers heightens your sense of touch; flavor." },
    { "id": 145, "category": "general", "rarity": "Common", "text": "A subtle shimmer makes a small emblem on your shield stand out." },
    { "id": 146, "category": "general", "rarity": "Common", "text": "A polite clang sounds when your weapon taps armor; oddly musical." },
    { "id": 147, "category": "general", "rarity": "Common", "text": "A small, harmless spark flares at the tip of your weapon and dies." },
    { "id": 148, "category": "general", "rarity": "Common", "text": "A soft tone hangs in the air as you make a bold move; decorative." },
    { "id": 149, "category": "general", "rarity": "Common", "text": "A brief warmth spreads through your arms, steadying your grip." },
    { "id": 150, "category": "general", "rarity": "Common", "text": "A tiny flash of harmless color blooms where your weapon lands, then fades." },
    { "id": 151, "category": "general", "rarity": "Uncommon", "text": "You feel a surge that grants you a small boost of vigor (roleplay; DM may grant minor benefit)." },
    { "id": 152, "category": "general", "rarity": "Uncommon", "text": "A focused spark empowers your next strike with extra flair (flavorful small bonus)." },
    { "id": 153, "category": "general", "rarity": "Uncommon", "text": "A steadying pulse steadies your aim, making a precise action feel easier." },
    { "id": 154, "category": "general", "rarity": "Uncommon", "text": "A bright mote of light marks your weapon, making it more visible and confident." },
    { "id": 155, "category": "general", "rarity": "Uncommon", "text": "A small shield of warming light surrounds you briefly, easing aches (flavor)." },
    { "id": 156, "category": "general", "rarity": "Uncommon", "text": "A burst of kinetic pep gives your legs a quick spring; small repositioning help (DM decides)." },
    { "id": 157, "category": "general", "rarity": "Uncommon", "text": "A short, resonant chord grants a momentary edge to your next maneuver (flavor)." },
    { "id": 158, "category": "general", "rarity": "Uncommon", "text": "A focused breath clears your head, letting you react smoothly to danger." },
    { "id": 159, "category": "general", "rarity": "Uncommon", "text": "A sharp, bright flash distracts foes briefly (DM adjudicates small effect)." },
    { "id": 160, "category": "general", "rarity": "Uncommon", "text": "A helper spark shows a better footing for an instant, aiding balance." },
    { "id": 161, "category": "general", "rarity": "Uncommon", "text": "A healing warmth soothes a minor bruise, restoring a little vigor (flavor only)." },
    { "id": 162, "category": "general", "rarity": "Uncommon", "text": "A brief gust improves a thrown weapon's path slightly (DM optional small bonus)." },
    { "id": 163, "category": "general", "rarity": "Uncommon", "text": "A shimmer of resolve steadies your hand, improving a precise action's feel." },
    { "id": 164, "category": "general", "rarity": "Uncommon", "text": "A helpful spot of light picks out a safe footfall for a moment (flavorful aid)." },
    { "id": 165, "category": "general", "rarity": "Uncommon", "text": "A small, focused ember enhances the bite of your next nonmagical attack (flavor)." },
    { "id": 166, "category": "general", "rarity": "Uncommon", "text": "A brief pulse of energy tightens your muscles, giving a brief edge in speed." },
    { "id": 167, "category": "general", "rarity": "Uncommon", "text": "A short, resonant tone inspires an ally nearby with a burst of confidence (roleplay)." },
    { "id": 168, "category": "general", "rarity": "Uncommon", "text": "A faint shield of light reduces sharp discomfort for a moment; flavor benefit." },
    { "id": 169, "category": "general", "rarity": "Uncommon", "text": "A bright sparkle draws a foe's eye for an instant, giving room for a tactic (DM discretion)." },
    { "id": 170, "category": "general", "rarity": "Uncommon", "text": "A small, steadying warmth returns some composure, aiding subsequent actions." },
    { "id": 171, "category": "general", "rarity": "Rare", "text": "A bright flash distracts one creature you can see; it has disadvantage on the next attack roll or ability check it makes before the end of its next turn." },
    { "id": 172, "category": "general", "rarity": "Rare", "text": "A ringing note steadies your focus; you have advantage on the next attack roll or ability check you make before the end of your next turn." },
    { "id": 173, "category": "general", "rarity": "Rare", "text": "A gentle gust nudges you; you can immediately move up to 5 feet without provoking opportunity attacks." },
    { "id": 174, "category": "general", "rarity": "Rare", "text": "A tiny thunderpop startles nearby creatures; one creature of your choice within 10 feet must succeed on a DC 10 Wisdom save or is distracted, granting you or an ally advantage on the next check against it before the end of your next turn." },
    { "id": 175, "category": "general", "rarity": "Rare", "text": "Your next damage roll from a weapon attack or spell before the end of your next turn deals an extra 1d4 damage of a type of your choice." },
    { "id": 176, "category": "general", "rarity": "Rare", "text": "You can take one additional bonus action this turn, but only to Dash, Disengage, or Use an Object (simple interaction)." },
    { "id": 177, "category": "general", "rarity": "Rare", "text": "A spectral buckler hovers at your side for 1 minute; you gain +1 AC. The buckler vanishes if you are incapacitated." },
    { "id": 178, "category": "general", "rarity": "Rare", "text": "You can cast one cantrip you know as a bonus action this turn." },
    { "id": 179, "category": "general", "rarity": "Rare", "text": "As a bonus action, you can teleport up to 10 feet to an unoccupied space you can see." },
    { "id": 180, "category": "general", "rarity": "Rare", "text": "You and one ally you can see each regain 1d6 hit points." },
    { "id": 181, "category": "general", "rarity": "Legendary", "text": "Until the start of your next turn, you have resistance to all damage and advantage on saving throws." },
    { "id": 182, "category": "general", "rarity": "Legendary", "text": "Your next attack or spell that deals damage before the end of your next turn deals maximum damage." },
    { "id": 183, "category": "general", "rarity": "Legendary", "text": "As a bonus action this turn, you can teleport to any unoccupied space you can see within 120 feet." },
    { "id": 184, "category": "general", "rarity": "Legendary", "text": "A spectral guardian shields your group for 1 minute; as a reaction (once per round), it imposes disadvantage on one attack against you or an ally within 10 feet." },
    { "id": 185, "category": "general", "rarity": "Legendary", "text": "You gain a 60-foot flying speed for 1 minute." }
  ],
  "legendaryIds": [96,97,98,99,100,181,182,183,184,185]
}